#pragma once

//===================================================================================
//		マップ関連
//===================================================================================

    // 定数
    const int kMapBlockSize = 40;// ブロックのサイズ
    const int kMapTypeNum   = 64;// マップチップの種類数
    const int kMapChipSize  = 32;// マップチップのサイズ

    // 列挙型
    enum MapChip
    {
        //真っ黒のタイル 
        Space = 0, 
        //氷のタイル 
        IceTile=10, 
        //レンガの壁
        Wall = 2, 
        //薄い土タイル 
        SoilTail1=48, 
        //土タイル 
        SoilTail2=44, 
        //濃い土タイル 
        SoilTail3=45,
        //灰色レンガタイル
        BrickTail=35, 
        //灰色タイル 
        grayTail=9,
    };
